#include<stdio.h>
int type1(int a[]); //判断是非为第一种格式
int type2(int a[]); //判断是否为第二种格式
int date(int a[]);  //计算日期差
int main()
{
    int a[3],flag1=0,flag2=0;
    char *p[13]={"","January","February","March","April","May","June","July","August","September","October","November","December"};
    scanf("%d/%d/%d",&a[0],&a[1],&a[2]);
    flag1=type1(a);
    flag2=type2(a);
    if(flag2&&flag1)
    {
        printf("%ld",date(a));
    }
    else if(flag1)
    {
        printf("%s %d, 20%d",p[a[0]],a[1],a[2]);
    }
    else if(flag2)
    {
        printf("%s %d, 20%d",p[a[1]],a[2],a[0]);
    }
    system("pause");
    return 0;
}
int type1(int a[])
{
    int flag=1;
    if((a[0]<1)||(a[0]>12)||  //月份不对
    (a[0]<=7&&a[0]%2==1&&a[1]>31)||  //7月前奇数月份大于31天
    (a[0]!=2&&a[0]<=7&&a[0]%2==0&&a[1]>30)||  //7月前除2月的偶数月大于30天
    (a[0]>=8&&a[0]%2==0&&a[1]>31)||  //8月后偶数月大于31天
    (a[0]>=8&&a[0]%2==1&&a[1]>30)||  //8月后奇数月大于30天
    (a[0]==2&&((a[2]+2000)%400==0||((a[2]+2000)%4==0&&(a[2]+2000)%100!=0))&&a[1]>29)||  //闰年2月29
    (a[0]==2&&!((a[2]+2000)%400==0||((a[2]+2000)%4==0&&(a[2]+2000)%100!=0))&&a[1]>28))  //平年2月28
    flag=0;
    return flag;
}
int type2(int a[])
{
    int flag=1;
    if((a[1]<1)||(a[1]>12)||
    (a[1]<=7&&a[1]%2==1&&a[2]>31)||
    (a[1]!=2&&a[1]<=7&&a[1]%2==0&&a[2]>30)||
    (a[1]>=8&&a[1]%2==0&&a[2]>31)||
    (a[1]>=8&&a[1]%2==1&&a[2]>30)||
    (a[1]==2&&((a[0]+2000)%400==0||((a[0]+2000)%4==0&&(a[0]+2000)%100!=0))&&a[2]>29)||
    (a[1]==2&&!((a[0]+2000)%400==0||((a[0]+2000)%4==0&&(a[0]+2000)%100!=0))&&a[2]>28))
    flag=0;
    return flag;
}
int date(int a[])
{
    int d1=0,d2=0;  //分别表示两种格式从0000年1月1日到这天的天数
    int m[13]={0,31,28,31,30,31,30,31,31,30,31,30,31};
    d1=(a[2]+2000)*365;  //先不管月份
    for(int i = 1;i <a[0];i++)
    {
        d1=d1+m[i];
    }
    if(a[0]==2&&a[1]==29)d1=d1-1; //因为后面会统一处理闰年问题，所以如果是闰年2月29要先减掉
    d1=d1+a[1];

    //加上今年之前的闰年的年数（以是否过了2月末来判断包不包含今年）
    if(a[0]==1||(a[0]==2&&a[1]<=28))d1=d1+((a[2]+2000)-1)/4-((a[2]+2000)-1)/100+((a[2]+2000)-1)/400;
    else d1=d1+(a[2]+2000)/4-(a[2]+2000)/100+(a[2]+2000)/400;

    
    d2=(a[0]+2000)*365;
    for(int i = 1;i <a[1];i++)
    {
        d2=d2+m[i];
    }
    if(a[1]==2&&a[2]==29)d2=d2-1;
    d2=d2+a[2];
    if(a[1]==1||(a[1]==2&&a[2]<=28))d2=d2+((a[0]+2000)-1)/4-((a[0]+2000)-1)/100+((a[0]+2000)-1)/400;
    else d2=d2+(a[0]+2000)/4-(a[0]+2000)/100+(a[0]+2000)/400;
    if(d1>d2)return d1-d2;
    else return d2-d1;
}